import * as date from "../utils/date"

export const ctg ={
    matches : [
            { day : "مباريات اليوم" , date : date.generateTodayDate() },
            { day : "مباريات الأمس" , date : date.generateYesterdayDate() },
            { day : "مباريات الغد" , date : date.generateTomorrowDate() }
    ] ,
    players : [
        [
           { title : "الدوري الإنجليزي" } ,
           { player : "محمد صلاح"   , id : 11803} , 
           { player : "كريستيانو رونالدو" , id : 4313} ,
           { player : "رياض محرز" , id : 102087} ,
           { player : "ساديو ماني"  , id : 89752},
           { player :  "هاري كين" , id : 83662} ,
        ] , 
        [
            {title :  "الدوري الإيطالي" } ,
            {player :  "إبراهيموفيتش"  , id : 4695}  , 
            {player :  "لاوتارو مارتينيز" , id : 130992} ,
            {player :  "إسماعيل بناصر" , id : 124311} ,
            {player :  "باريلا" , id : 21503},
            {player :  "باولو ديبالا" , id : 90511}
        ] ,
        [
            { title : "الدوري الإسباني" } ,
            { player : "توني كروس " , id : 24863} , 
            {player : "لوكا مودريتش" , id : 24559} ,
            { player : "بيدري"  , id : 148954},
            { player : "كريم بنزيما"  , id : 21490},
            { player : "لويس سواريز"  , id : 33085}
        ] ,
        [
            { title : "الدوري السعودي" } ,
            { player : "عبد الرزاق حمدالله" , id : 73398} , 
            { player : "فينسنت أبوبكر" , id : 53378} ,
            { player : "سالم الدوسري"  , id : 79113},
            { player : "إيفر بانيغا"  , id : 33041},
            { player : "عمر السومة"  , id : 37981}
        ] ,
    ],
    leagues : [
        [
           { title : "مسابقات عالمية" } ,
           { team : "الدوري الإنجليزي"   , id : 22309} , 
           { team : "الدوري الإسباني "  , id : 22393},
           {team :  "الدوري الإيطالي" , id : 22426} ,
           { team : "الدوري الألماني" , id : 22365} ,
        ] , 
        [
            {title :  "مسابقات قارية" } ,
            {team :  "دوري أبطال أوروبا"  , id : 22310}  , 
            {team :  "الدوري الأوروبي " , id : 22275} ,
            {team :  "دوري أبطال إفريقيا " , id : 22709} ,
            {team :  "دوري أبطال آسيا" , id : 21503}
        ] ,
        [
            { title : "مساباقات عربية" } ,
           { team : "الدوري السعودي" , id : 22551} , 
            {team : "الدوري المغربي" , id : 22826} ,
           { team : "الدوري المصري "  , id : 22839}
        ] ,
    ]
    ,
    teams :[
        [   {league :  "إنجلترا" },
            {
                team : "ليفربول" , 
                id : 11
            }  ,  
            {
                team : "مانشسر سيتي" , 
                id : 12
            }  ,  
            {
                team : "تشيلسي" , 
                id : 7
            }  ,  
            {
                team : "مانشستر يونايتد" , 
                id : 13
            }  ,  
            {
                team : "أرسنال" , 
                id : 1
            }  
        ] , 
        [
            { league : "إسبانيا"} ,
            {
                team : "برشلونة" , 
                id : 63
            }  ,  
            {
                team : "ريال مدريد", 
                id : 71
            }  ,  
            {
                team : "أتليتيكو مدريد" , 
                id : 62
            }  ,   
        ] , 
        [
            {league : "إيطاليا"} ,
            {
                team : "ميلان" , 
                id : 21
            }  ,  
            {
                team : "يوفينتوس" , 
                id : 31
            }  ,  
            {
                team : "إنتر" , 
                id : 29
            }  ,  
            {
                team : "نابولي" , 
                id : 964
            }  ,
        ] , 
        [
            {league :  "السعودية"} ,
            {
                team : "الهلال" , 
                id : 152
            }  ,  
            {
                team : "الإتحاد" , 
                id : 145
            }  ,  
            {
                team : "النصر" , 
                id : 146
            }  ,  
            {
                team : "الأهلي" , 
                id : 147
            }  ,  
        ] , 
        [
            {league : "المغرب"} ,
            {
                team : "الرجاء" , 
                id : 445
            }  ,  
            {
                team : "الوداد" , 
                id : 864
            }  ,  
            {
                team : "الجيش الملكي" , 
                id : 1297
            }  ,  
            {
                team : "نهضة بركان" , 
                id : 6186
            }  ,  
        ] , 
        [
            {league : "مصر" } ,
            {
                team : "الأهلي" , 
                id : 131
            }  ,  
            {
                team : "الزمالك" , 
                id : 132
            }  ,  
            {
                team : "بيراميدز" , 
                id : 22493
            }  
        ] 
    ]
}